src/Documents/Scan_ЗаявкаПеревозчику/Scan_ЗаявкаПеревозчику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗаявкаПеревозчику</name>
  <basedOn>Document.Scan_ЗаявкаПеревозчику</basedOn>
  <basedOn>Document.Scan_ЗаявкаНаДействие</basedOn>
  <registerRecords>InformationRegister.Scan_РеестрОказанныхУслуг</registerRecords>
  <registerRecords>AccumulationRegister.Scan_МестонахождениеИзделий</registerRecords>
  <registerRecords>AccumulationRegister.Scan_ЗаявкиНаДействия</registerRecords>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорСПеревозчиком</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставкиИзделий</name>
    <type>
      <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпанияОтправитель</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОтгрузки</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпанияПолучатель</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоДоставки</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетСогласования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторнирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвержденаПеревозчиком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>CatalogRef.Scan_СтатусыЗаявокНаДействие</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУходаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснованиеКорректировки</name>
    <comment>служебный реквизит</comment>
    <type>
      <types>DocumentRef.Scan_ЗаявкаПеревозчику</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОказанныхУслуг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактыОтправителя</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.Scan_КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтактнойИнформации</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактыПолучателя</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.Scan_КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтактнойИнформации</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставЗаявки</name>
    <attributes>
      <name>ЗаявкаНаДействие</name>
      <type>
        <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
      </type>
    </attributes>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>Дилер</name>
      <type>
        <types>CatalogRef.Scan_Компании</types>
        <types>CatalogRef.Scan_Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУходаФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставкиФакт</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставкиПлан</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарииТК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Scan_ЗаявкаПеревозчику</types>
        <types>DocumentRef.Scan_ЗаявкаНаДействие</types>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОказанныеУслуги</name>
    <attributes>
      <name>Изделие</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Scan_НоменклатураУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененаВручную</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.Scan_СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/Scan_ВидыДокументов/Scan_ВидыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ВидыДокументов</name>
  <comment>(scania)</comment>
  <enumValues>
    <name>ЗаявкаНаДействие</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаПеревозчику</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_ДополнительныеУсловияДоставки/Scan_ДополнительныеУсловияДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ДополнительныеУсловияДоставки</name>
  <attributes>
    <name>ИспользоватьПоУмолчаниюВПФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИспользованиеВДокументах</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>EnumRef.Scan_ВидыДокументов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/Scan_ЗаявкаПеревозчику/Forms/ФормаНастроекПечати/Module.bsl
//rarus sergei 28.09.2016 mantis 7160 ++
&НаСервере
Процедура ЗаполнитьДопУсловияДоставки()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ДополнительныеУсловияДоставки.Ссылка
	               |ИЗ
	               |	Справочник.Scan_ДополнительныеУсловияДоставки КАК Scan_ДополнительныеУсловияДоставки
	               |ГДЕ
	               |	Scan_ДополнительныеУсловияДоставки.ИспользоватьПоУмолчаниюВПФ = ИСТИНА
	               |	И Scan_ДополнительныеУсловияДоставки.ИспользованиеВДокументах.Документ = ЗНАЧЕНИЕ(Перечисление.Scan_ВидыДокументов.ЗаявкаПеревозчику)";
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Условие Из Результат Цикл
		НоваяСтрока = ДопУсловия.Добавить();
		НоваяСтрока.ДопУсловие = Условие.Ссылка;	
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДанныеДляПечати.ЗагрузитьЗначения(Параметры.ДанныеДляПечати);
	ЗаполнитьДопУсловияДоставки();
	НастройкаТаможенногоОФормленияИДопУсловий();
КонецПроцедуры


&НаСервере
Процедура НастройкаТаможенногоОФормленияИДопУсловий()
	Если ВыводитьТаможенноеОформление = Истина Тогда
		Элементы.ТОСтранаПрибытия.ТолькоПросмотр  = Ложь;
		Элементы.ТОСтранаОтправления.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ТОСтранаПрибытия.ТолькоПросмотр  = Истина;
		Элементы.ТОСтранаОтправления.ТолькоПросмотр = Истина;	
	КонецЕсли;	
	Если ПоказыватьДопУсловия = ИСТИНА Тогда
		Элементы.ДопУсловия.Видимость = Истина;
	Иначе
		Элементы.ДопУсловия.Видимость = ЛОЖЬ;
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура ПоказыватьДопУсловияПриИзменении(Элемент)
	НастройкаТаможенногоОФормленияИДопУсловий();
КонецПроцедуры


&НаКлиенте
Процедура ВыводитьТаможенноеОформлениеПриИзменении(Элемент)
	НастройкаТаможенногоОФормленияИДопУсловий();
КонецПроцедуры


&НаКлиенте
Процедура КомандаОк(Команда)
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(    "Документ.Scan_ЗаявкаПеревозчику",        //Менеджер печати
                            "ПФ_MXL_ЗаявкаПеревозчику",            //Идентификатор
                            ПолучитьОбъектыДляПечати(),        //Объекты печати
                            ЭтотОбъект,                //Владелец формы - форма из которой вызывается печать
                            ПолучитьПараметрыПечати());        //Параметры печати - произвольные параметры для передачи в менеджер печати
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектыДляПечати()
    Массив = ДанныеДляПечати.ВыгрузитьЗначения();
    Возврат Массив;
КонецФункции

&НаСервере
Функция ПолучитьПараметрыПечати()
    
    ПараметрыПечати = Новый Структура;
    
    ПараметрыПечати.Вставить("ЗаголовокФормы", "Печатная форма");                    //Один из параметров, для формы "Печать документа".
                                                    //Указывает заголовок формы вывода печатной формы.
	ПараметрыПечати.Вставить("ВыводитьВесИзделий",           ВыводитьВесИзделий);
	ПараметрыПечати.Вставить("ВыводитьГруппировкиИзделий",   ВыводитьГруппировкиИзделий);
	ПараметрыПечати.Вставить("ВыводитьГХПродуктовИзделий",   ВыводитьГХПродуктовИзделий);
	ПараметрыПечати.Вставить("ВыводитьСпецификацииИзделий",  ВыводитьСпецификацииИзделий);
	ПараметрыПечати.Вставить("ВыводитьТаможенноеОформление", ВыводитьТаможенноеОформление);
	ПараметрыПечати.Вставить("ПоказыватьДопУсловия",         ПоказыватьДопУсловия);
	ПараметрыПечати.Вставить("ТОСтранаОтправления",          ТОСтранаОтправления);
	ПараметрыПечати.Вставить("ТОСтранаПрибытия",             ТОСтранаПрибытия);
	ПараметрыПечати.Вставить("ДопУсловия",                   ДопУсловия);
	// rarus agar 14.12.2022 19668 ++
	ПараметрыПечати.Вставить("ВыводитьЛоготип",              ВыводитьЛоготип);
	// rarus agar 14.12.2022 19668 --
    Возврат ПараметрыПечати;
    
КонецФункции
//rarus sergei 28.09.2016 mantis 7160 --
